Repository: magi1125/inclusive-design-pattern
Catalog: tm/chapter-9_EN-US_JA.tmx
Source language: en_us
Languages: ja

source: The Document
ja: ドキュメント

source: While other chapters of this book will look into discrete interface patterns — conventions realized as modules or components — it would be foolhardy to not recognize that each of these will ultimately belong to a web document.
ja: 後続の章で個々のインターフェイスパターン（モジュールあるいはコンポーネントとして確立された決まり事）を詳しく見ていく前に、まずは1つひとつのパターンが最終的にWebドキュメントを構成することを理解しておかなければなりません。

source: HTML pages vary dramatically in shape and size, and can include any combination of patterns; but there are a handful of document-level best practices we should stick to.
ja: HTMLページは形もサイズも実にさまざまで、パターンの組み合わせも自由です。しかし、従うべきドキュメントレベルのベストプラクティスがいくつか存在します。

source: The aim here is not to go in search of the ultimate boilerplate but to configure a parent web page for an inclusive interface.
ja: ここでの目的は究極のひな形を見つけることではなく、インクルーシブなインターフェイスの親Webページを作ることです。

source: The Doctype
ja: Doctype

source: Whether your web page is an old-school static resource or a single-page app, it is unavoidably a document.
ja: 昔ながらの動きのないリソースでも、シングルページアプリケーションでも、Webページはドキュメントです。

source: The clue is in the “DOC” part which should appear in the first line of code: <!DOCTYPE html>.
ja: ？？そのことを示すのが、コードの一行目にくるべき「ドキュメントタイプ（文書型）宣言」部の<!DOCTYPEhtml>です。？？【コメント：意訳しています。原文「The clue is in the “DOC” part which should appear in the first line of code: <!DOCTYPEhtml>.」】

source: This serves as an important reminder that even when you’re designing a highly tactile and dynamic interface, you are still really just putting content into a browser window.
ja: この宣言は、立体的に見えて動きのあるインターフェイスのデザインも、結局はコンテンツをブラウザのウィンドウに表示させることに変わりないという事実を思い出させてくれます。

source: Never forget that the browser itself is an interface, which can be augmented and configured in a number of ways by the user — as well as helping interpret the content you provide for third-party assistive technologies like screen readers.
ja: ブラウザ自体も1つのインターフェイスだということを忘れてはいけません。スクリーンリーダーのようなサードパーティの支援技術向けコンテンツの解釈を助けたり、ユーザーがさまざまな方法で設定や拡張を行うことができます。

source: Your subsidiary interface should be tolerant of users’ differing setups and configurations.
ja: したがって、それを補助する私たちが作るインターフェイスは、ユーザー側の多様なセットアップや設定に対応できなければなりません。

source: Diagram labels your interface hidden among all the browser interface elements.
ja: インターフェイスあなたがデザインするインターフェイス

source: Your interface is not the only interface users are interacting with when their browsers are open.
ja: ユーザーがブラウザを開いたときに使用するインターフェイスは、あなたがデザインするインターフェイスだけではありません。

source: In addition, the omission of the aforementioned doctype declaration can result in unexpected and broken behavior for users.
ja: その上、前述したドキュメントタイプ宣言を省略してしまうと、ユーザーにとって予期せぬ異常な動作が生じる可能性があります。

source: Without a doctype declared, the browser simply doesn’t know how to interpret the content and can regress into a non-compliant and incompatible mode, often called quirks mode1.
ja: ドキュメントタイプの宣言がないと、ブラウザはコンテンツをどう解釈したらよいか分からず、非対応の不適合なモード、いわゆる互換モード（脚注4）に後方互換されてしまうこともあります。

source: Layout and interaction can become error-prone and unpredictable.
ja: その場合、レイアウトやインタラクションのエラーが起こるなど、予測不可能な動作が生じる可能性があります。

source: If things get plain odd when testing a web page, I always check for a doctype before trying anything else.
ja: Webページのテスト時におかしなことが起きたときは、私は必ず最初にdoctypeを確認します。

source: I’ve been stung too many times.
ja: それで何度も痛い目にあってきましたから。

source: The lang Attribute
ja: lang属性

source: If the doctype tells the browser what kind of document it is serving (HTML5 in the above example), then the <html> element’s lang attribute tells it which language it is written in.
ja: doctypeでドキュメントの種類（上の例はHTML5）を宣言したら、次は<html>要素のlang属性でドキュメントを記述する言語を指定します。

source: I’m not talking HTML or XHTML; I mean English or French.
ja: この場合の言語とは、HTMLやXHTMLではなく、英語やフランス語のことです。

source: <html lang="en" <!-- language set to English -->
ja: <html lang="en"> <!-- 言語を英語に設定-->

source: Though frequently omitted, declaring a language for a web page could scarcely be more important.
ja: Webページの言語の明示は、省略されることも少なくありませんが、とても重要な意味を持ちます。

source: Not only does it make the page more indexable by search engines, but it also becomes easier to translate by users operating third-party tools such as Google’s Translate API2.
ja: 検索エンジンによるインデックス付けがやりやすくなるほか、ユーザーがGoogleのTranslate API（脚注5）のようなサードパーティツールを使って翻訳するときもスムーズに行えます。

source: It also helps the user to write in the page’s language.
ja: また、ユーザーがページの言語で入力する際にも役立ちます。

source: Firefox, for instance, changes dictionaries on <textarea>s so that spelling errors are highlighted appropriately.
ja: たとえばFirefoxでは、スペルの間違いが適宜ハイライト表示されるように<textarea>の辞書が変更されます。

source: Perhaps most starkly, a page that does not have a language declared — or has the wrong language declared for the content — will not trigger the adoption of an appropriate synthetic voice profile when used with a screen reader.
ja: おそらく最も際立った点としては、言語が明示されていないページや、あるいはコンテンツと異なる間違った言語が指定されているページでは、スクリーンリーダーを使用したときに適切な合成音声プロファイルが選択されません。

source: That is, if <html lang="en"> is present but the text is actually in French, you’d hear a voice profile called Jack doing a bad impression of French, rather than a French profile called Jaques using authentic French pronunciation.
ja: たとえば、<htmllang="en">と記されているのに実際にはフランス語が書かれていると、フランス語の音声プロファイルなら正しいフランス語の発音で「Jaques」と読むところを、英語のプロファイルが「Jack」と読んでしまうため、まずい（発音の悪い）フランス語に聞こえてしまいます。

source: In addition to screen readers and computer braille displays benefiting from proper language declaration, it also helps browsers choose and render system fonts with the appropriate character sets.
ja: スクリーンリーダーやコンピュータ点字ディスプレイの使用時のメリットに加えて、正しい言語が明示されていると、ブラウザもシステムフォントを選択したり適切な文字セットを使って表示できます。

source: For instance, lang="zh-Hans" will invoke the rendering of a simplified Chinese font.
ja: たとえばlang="zh-Hans”と指定すると、簡体字中国語フォントが表示されます。

source: Garbled text, rendered in unbefitting characters is not optimally inclusive of your readership to say the least.
ja: 文字セットが合っていないと文字化けが起こります。それでは、控えめに言っても閲覧者にとってインクルーシブとは言えません。

source: It is possible to switch languages within a page using the lang attribute on child elements within the <body>.
ja: <body>内で子属性にlang属性を使用して、1つのページの中で言語を切り替えることも可能です。

source: For instance, I may want to quote some French within an English language page:
ja: たとえば英語のページの中で部分的にフランス語を引用したい場合は、次のように記述します。

source: In my CSS I can select any sections declared as French using the :lang pseudo-class, applying a font well suited to the French character set, thereby improving legibility:
ja: さらにCSSで:lang擬似クラスを使ってフランス語に指定されているセクションを選択し、フランス語の文字セットに適したフォントを適用すれば、より読みやすくなります。

source: The lang attribute can be used to improve the readability, translatability and compatibility of web documents’ written content, helping open it up to an international audience.
ja: lang属性を使用してWebドキュメントに書かれたコンテンツの読みやすさ、翻訳のしやすさ、互換性を向上させれば、世界中の人に読んでもらうことができます。

source: It’s easy to include the lang attribute, so just go ahead and include it.
ja: lang属性の使い方は簡単なので、ぜひとも使ってみてください。

source: Responsive Design
ja: レスポンシブデザイン

source: Responsive design is a big part of inclusive design.
ja: レスポンシブデザインはインクルーシブデザインの重要な要素の1つです。

source: By designing documents that can respond and adapt to their environment, they become compatible with the ever proliferating choice of devices on the market.
ja: 状況に対応できるようにデザインされたドキュメントは、市場に次から次へと登場するさまざまなデバイスに対応できます。

source: This book is not the place to discuss the ins and outs of responsive design, but you should be aware of some responsive design principles that support inclusive design.
ja: 本書ではレスポンシブデザインについて詳述はしませんが、ぜひ知っておきたい、インクルーシブデザインを後押しするレスポンシブデザインの原則をいくつか紹介します。

source: Content Breakpoints
ja: コンテンツのブレイクポイント

source: Targeting the specific viewports of specific devices (employing device breakpoints) is an exercise in futility if you want to create a truly inclusive experience.
ja: 真にインクルーシブな体験を作りたいなら、特定のデバイスの特定のビューポートをターゲットにする（デバイスのブレイクポイントを使用する）のは無駄足というものです。

source: There are just too many viewport variations available to support each one.
ja: 1つひとつに対応するには、あまりにビューポートのバリエーションが多すぎます。

source: Instead, you should create an entirely flexible design from the outset and insert breakpoints only where the content breaks the layout — hence content breakpoint or tweakpoint.
ja: それよりも、最初から完全に柔軟なデザインを作り、コンテンツによってレイアウトが切り替わるブレイクポイント、すなわちコンテンツのブレイクポイント（微調整ポイント）を挿入すべきです。

source: By employing content breakpoints, you can ensure successful layouts for a range of devices far greater than you would ever be able to manually test with.
ja: コンテンツのブレイクポイントを使用すれば、1つひとつ手作業でテストするよりもはるかに幅広いデバイスに対応したレイアウトをデザインできます。

source: Unless your superpower is prescience and you can anticipate the device setup of each and every one of your users, this is the only way to go.
ja: あなたに予知能力があって、ユーザー1人ひとりのデバイスのセットアップを予想できるというなら話は別ですが、そうでなければこれが唯一の策です。

source: Locating content breakpoints is easy using Firefox’s responsive design mode3.
ja: コンテンツのブレイクポイントを配置する際は、Firefoxのレスポンシブデザインモード（脚注6）を使うと簡単です。

source: Just press Cmd + Option + M, then resize the simulated viewport incrementally until the content is forced to collide, overlap or wrap.
ja: Cmd + Option + Mキーを押したら、シミュレートされたビューポートを、コンテンツがぶつかる、重なり合う、あるいはラップされるところまで少しずつ大きくしていきます。

source: The responsive design mode interface displays the current dimensions, allowing you to record and attend to that breakpoint.
ja: レスポンシブデザインモードではインターフェイスに現在の寸法が表示されるため、記録しておいてそのブレイクポイントに注意を払うことができます。

source: A small, black box represents the smallest conceivable viewport and a larger gray box grows from it to represent infinite larger viewports.
ja: あるブラウザの最小ビューポート

source: Your responsive design should cover every width.
ja: レスポンシブデザインはあらゆる幅に対応していなければなりません。

source: That doesn’t mean you need a breakpoint for every width.
ja: ただしそれは、1つのブレイクポイントですべての幅に対応しなければならないということではありません。

source: Simple interfaces are usable interfaces, and much less work in terms of managing breakpoints.
ja: シンプルなインターフェイスは使いやすい上に、ブレイクポイントの管理の手間がはるかに少なくて済みます。

source: As a rule of thumb, you should never set a fixed width or height on any element: the intrinsic flexibility of boxes means they can tolerate the same content in different spaces.
ja: 経験から言うと、どんな要素も幅や高さを固定すべきではありません。ボックスに柔軟性があれば、同じコンテンツでさまざまなスペースに対応できます。

source: Web pages behave like this without author CSS, and should continue to respect this fundamental behavior where CSS is included.
ja: Webページは、オーサーCSSがないとこのように動作し、CSSをインクルードする場合もこの基本動作に従うべきです。

source: Allow Pinch-to-Zoom
ja: 拡大／縮小を可能にする

source: The viewport meta tag is where responsive design is, somewhat magically, enabled.
ja: viewportメタタグは、レスポンシブデザインが可能になる、ちょっとした魔法のようなものです。

source: Yet it’s also where we habitually disable users’ ability to zoom content, making experiences, well, less magical.
ja: しかし、このタグのせいでユーザーがコンテンツを拡大／縮小できず、魔法の効果が薄れてしまうケースも少なくありません。

source: In an informal poll I took on Twitter asking my followers about the biggest mistakes designers make regarding inclusion, the suppression of pinch-zoom on handheld devices was by far the most cited.
ja: 私がTwitterでフォロワーを対象に行った、デザイナーが犯すインクルージョン関連の最大のミスは何か？という調査では、「携帯端末で拡大／縮小ができない」が群を抜いて1位でした。

source: To be clear, then, the first of what follows is unacceptable; the second is correct.
ja: 分かりやすい例をお見せしましょう。1つ目は不適正な例、2つ目は正しい例です。

source: <!-- don’t use this --> <meta name="viewport" content="width=device-width, initial-scale=1.0, minimum-scale=1.0, maximum-scale=1.0, user-scalable=no"> <!-- use this --> <meta name="viewport" content="width=device-width, initial-scale=1.0">
ja: <!-- これは使わないでください --> <meta name="viewport" content="width=device-width, initial-scale=1.0, minimum-scale=1.0, maximum-scale=1.0, user-scalable=no"> <!-- これを使ってください --> <meta name="viewport" content="width=device-width, initial-scale=1.0">

source: Adrian Roselli provides a comprehensive list of reasons why disabling this feature undermines inclusion4:
ja: この機能を無効にするとインクルージョンが損なわれる理由を、エイドリアン・ロセッリ（Adrian Roselli）がリストアップしています。（脚注7）

source: •The text may be too small for the user to read.
ja: • テキストが小さすぎて読めない恐れがある。

source: •The user may want to see more detail in an image.
ja: • もっと詳細な画像が見たいと思うユーザーがいるかもしれない。

source: •Selecting words to copy/paste may be easier for users when the text is larger.
ja: • テキストが大きい方が、コピー／ペーストしたい単語を選択しやすい。

source: •The user wants to crop animated elements out of the view to reduce distraction.
ja: • ユーザーは、邪魔なアニメーション要素を表示したくない。

source: •The developer did a poor job of responsive design, and the user needs to zoom just to use the page (this happens!).
ja: • 開発者がきちんとレスポンシブデザインを作らないと、ユーザーはページを利用するために拡大／縮小が必要になる（よくあるパターン）。

source: •There is a browser bug or quirk (still a bug) that causes the default zoom level to be odd.
ja: • ブラウザのバグや後方互換（つまりはバグ）のせいで、デフォルトの表示倍率では正しく表示されないことがある。

source: •It can be confounding for users when a pinch/spread gesture is interpreted as something else.
ja: • ピンチ／スプレッドの動作が拡大／縮小以外の意味に解釈されるとユーザーが混乱する。

source: You may recall my remark earlier that the browser itself is an interface.
ja: 前述したように、ブラウザ自体もインターフェイスです。

source: To achieve inclusive design you should act as a facilitator, allowing users to configure the way they view and interact with the content you provide them.
ja: インクルーシブデザインを実現するためには、デザイナーはまとめ役となって、提供するコンテンツの表示方法やインタラクションの仕方をユーザー側が設定できるようにしなければなりません。

source: The fewer decisions you make for them, the more they can make for themselves.
ja: デザイナーが決めることが少ないほど、ユーザーが決められることが多くなります。

source: If your layout breaks badly when a user zooms, the design is at fault, not the user, and removing their ability to zoom is not a solution.
ja: ユーザーが拡大／縮小したときにレイアウトが崩れてしまうとしたら、悪いのはユーザーではなくデザインです。拡大／縮小できないようにしたところで解決にはなりません。

source: As a rule of thumb, avoid using positioned elements, especially with position: fixed.
ja: 経験から言って、要素の位置を固定するのはやめましょう。特にposition:fixedでの固定は避けてください。

source: When content is enlarged, any elements stuck to a certain part of the screen are liable to become blind spots.
ja: 画面の特定の場所に固定された要素は、コンテンツを拡大したときに見えなくなる恐れがあります。

source: Font Size
ja: フォントサイズ

source: Desktop browsers tend to render fonts at 16px by default.
ja: デスクトップのブラウザでは、デフォルトのフォントサイズはたいてい16pxです。

source: There is a rationale for reasonably large defaults: anything else risks alienating a huge swath of users, many from older populations whose eyesight has deteriorated.
ja: デフォルトが大きめなのには理由があります。他のサイズでは、特に視力が低下した高齢者など、さまざまなユーザーを遠ざけてしまう恐れがあるからです。

source: “But my audience is young and hip!” I hear you say.
ja: 「でも私のページの閲覧者は若くて流行に敏感な人たちだから」。

source: Sure, but generous font sizes don’t offend young, keen-eyed folks.
ja: なるほど、そうかもしれません。しかし、フォントサイズが大きいからと言って、若くて眼力の鋭いユーザーが気分を害するとは思えません。

source: The key to inclusive design isn’t to target specific groups, it’s to not exclude groups arbitrarily — there’s nothing to gain.
ja: インクルーシブデザインで重要なのは、特定のユーザー層をターゲットにすることではなく、特定のユーザー層を恣意的に除外しないことです。ターゲットを絞ることで得るものは何一つありません。

source: You may already be accustomed to the convention of setting font size using a percentage, on the root (<html>) element like so:
ja: もうすでにご存じかもしれませんが、フォントサイズはルート（<html>）要素でパーセンテージで設定するようにしましょう。

source: In the example above, 100% is equal to 16px if the user has not adjusted the font size manually, either in their operating system or browser settings (e.g. under Preferences → Content in Firefox).
ja: この例では、ユーザーがオペレーティングシステムかブラウザの設定（たとえばFirefoxの場合は［＃＃Preferences＃＃］→［＃＃Content＃＃］）でフォントサイズを手動で調整していない限り、100％は16pxになります。

source: So, 100% is really “one hundred percent of the default size or the size the user has chosen.” If I were to set the font size explicitly as 16px at the root level, I would diminish the user’s ability to adjust font size to their liking.
ja: つまり、この100％は「デフォルトサイズまたはユーザーが選択したサイズの100％」を意味します。一方、ルートレベルでフォントサイズを明示的に16pxに設定した場合は、ユーザー側でフォントサイズを自由に調整できなくなります。

source: html { /* do not do this */ font-size: 16px; }
ja: html { /* この設定方法は使わないでください */ font-size: 16px; }

source: It is true that a greater number of users will operate full-page zoom using Cmd (or Ctrl) and +, but modern browsers and operating systems still support text-only resizing, and so should you.
ja: Cmd（またはCtrl）キーと＋キーを同時に押してフルページズームするユーザーがますます増えているのは確かです。しかし、最近のブラウザやオペレーティングシステムも従来どおりテキストのみのサイズ調整は可能なので、デザインもそうすべきです。

source: To make sure font-size, padding and margin all resize proportionately, each should be set using the relative units rem, em or ch.
ja: また、調整時にfont-size、padding、marginのバランスを保つために、それぞれを相対単位のremやemを使って設定する必要があります。

source: This greatly reduces the complexity of your media queries.
ja: そうすれば、メディアクエリの複雑さも大幅に軽減されます。

source: In the example below, the line-height and margin of the p will scale proportionately, because they are both set relative to the font-size.
ja: たとえば次の例では、pのline-heightとmarginはfont-sizeに相対的に設定されているため、両者のサイズのバランスは維持されます。

source: Where everything is set proportionately, whole pages can be scaled simply by adjusting the root font size, as in the media query that follows.
ja: すべてを相対的に設定しておけば、その後のメディアクエリのようにルートのフォントサイズを調整するだけでページ全体をサイズ調整できます。

source: (Note: To ensure the media query triggers at the correct point relative to user-defined font size, we are using the em unit there, too.
ja: （注：ユーザーが指定したフォントサイズに相対的に、正しいポイントで確実にメディアクエリが実行されるようにするためには、単位はemを使用しましょう。

source: The rem unit causes problems in Safari, as “PX, EM or REM Media Queries?5” by Zell Liew attests.)
ja: ？？ゼル・リュウ？？（Zell Liew）が「PX, EM or REM Media Queries?」（脚注8）で実証しているように、remだとSafariで問題が生じてしまいます。【コメント：名前の読み方が不安です】

source: An given font-size: 2rem; is two times larger than the size set at the root.
ja: たとえばをfont-size:2remと設定すると、ルートで設定されているサイズの2倍の大きさになります。

source: If the user has gone to Settings → Content in Firefox and set the default font size to 20px, 2rem will mean 2 × 20 — or 40px.
ja: ユーザーがFirefoxの［＃＃Settings＃＃］→［＃＃Content＃＃］でデフォルトのフォントサイズを20pxに設定している場合は、2remは2 × 20、つまり40pxになります。

source: Do not make the mistake of converting theoretical rem units into pixels via a CSS preprocessor.
ja: ？？あくまで計算上の単位であるremを、CSSプリプロセッサで間違ってピクセルに変換しないように注意してください。

source: It’s what ends up in the compiled CSS, parsable by browsers, that counts.
ja: 重要なのは、最終的にブラウザが解析する、コンパイル後のCSSです。？？【コメント：不安訳です。原文「Do not make the mistake of converting theoretical rem units into pixels via a CSS preprocessor.It’s what ends up in the compiled CSS, parsable by browsers, that counts.」】

source: Viewport Units
ja: ビューポートの単位

source: Viewport units present the opportunity to set text that scales with the height (vh) or width (vw) of the viewport.
ja: ビューポートの単位を使えば、ビューポートの高さ（vh）と幅（vw）に合わせてテキストのサイズを調整できます。

source: Essentially, this means you can employ implicitly responsive text without the need for media queries like that of the previous code example.
ja: つまり、前出のコード例のようなメディアクエリを用いずに、レスポンシブなテキストを明示的に使用できるというわけです。

source: You just need to address one issue: elements set using viewport units cannot be scaled using full-page zoom.
ja: ただし、1つだけ問題があります。ビューポートの単位を使って設定されている要素は、フルページズームでは拡大／縮小されません。

source: Zoom can be reinstated by entering a viewport unit-based value into a sum with an em-based value.
ja: ズームはビューポートの単位ベースの値とemベースの値を合計して行います。

source: This has the added advantage of ensuring a minimum font size for the page.
ja: この方法なら、ページの最小フォントサイズを確保できるというメリットもあります。

source: That is, 1em + (0 × 1vw) is still 1em.
ja: （1em+ (0× 1vw)でも1em）

source: With this algorithm in place, everything scales incrementally and proportionately relative to the viewport.
ja: このアルゴリズムでは、すべての要素がビューポートに相対的に拡大／縮小していきます。

source: It saves you a lot of manual coding without sacrificing accessibility.
ja: アクセシビリティを犠牲にすることなく、コードを書く手間を大幅に軽減できます。

source: The only modern browser that does not support viewport units at the time of writing is Opera Mini.
ja: 最近のブラウザでは唯一、Opera Miniがビューポートの単位をサポートしていません（本書の執筆時現在）。

source: Not to worry: font-size: calc(1em + 1vw); is a progressive enhancement.
ja: ただし、font-size: calc(1em+1vw);というプログレッシブエンハンスメントで対応できるため心配ありません。

source: Where it is not recognized, browsers fall back to the user agent’s default.
ja: ブラウザがビューポートの単位を認識できないときは、ユーザーエージェントのデフォルトが使用されます。

source: In other words, Opera Mini would display the body text as it would have liked to begin with.
ja: ？？つまり、Opera Miniでは本文テキストは本来のサイズで表示されるというわけです。？？【コメント：多少意訳しています。原文「In other words, Opera Mini would display the body text as it would have liked to begin with.」】

source: Progressive Enhancement
ja: プログレッシブエンハンスメント

source: Progressive enhancement, like responsive design, is a cornerstone of inclusive design.
ja: レスポンシブデザイン同様、インクルーシブデザインに欠かせないのがプログレッシブエンハンスメントです。

source: Much maligned as the arduous task of making web applications still do things when a unicorn-rare user switches JavaScript off, it has much broader implications.
ja: ユーザーがJavaScriptをオフにしていても（そんなユーザーは非常にまれですが）機能するWebアプリケーションを作るのは骨の折れる厄介な仕事ですが、プログレッシブエンハンスメントにはもっと広い意味があります。

source: Progressive enhancement is about building a strong foundation of content, logical and robust in form, which is resilient to a multitude of network and scripting failures.
ja: プログレッシブエンハンスメントの目的は、形式が合理的かつ堅牢で、さまざまなネットワーク障害やスクリプトエラーに対応できる、コンテンツの強固な基盤を作ることです。

source: It’s not just about JavaScript or CSS being unavailable, but when and how they are unavailable, for how long, and when they should be made available, and in what order.
ja: 単にJavaScriptやCSSが使えないということだけでなく、どんなときに、どのように、どのくらいの時間使えないのか、そしていつ、どういう順序で利用できるようにしたいのかが重要になります。

source: Patterns in this book are founded on well-formed and semantic HTML structures, enhanced by CSS and JavaScript.
ja: 本書で紹介するパターンは、整形式のセマンティックHTMLの構造をベースに、CSSとJavaScriptで強化したものです。

source: Where possible, integrated JavaScript widgets degrade into well-structured static content or interactive form elements, meaning users without JavaScript or CSS — temporarily or otherwise — can traverse and use content.
ja: 組み込みのJavaScriptウィジェットをきちんと構造化された静的なコンテンツやインタラクティブなフォーム要素に分解できれば、JavaScriptやCSSを（一時的に、あるいは常時）利用しないユーザーでもコンテンツをたどったり利用できるようになります。

source: Whether JavaScript is available or not, semantic HTML ensures an inclusive experience for assistive technology users and makes interaction behavior more predictable and efficient.
ja: セマンティックHTMLは、JavaScriptが使えるかどうかに関係なく、支援技術ユーザーにインクルーシブな体験を保証し、インタラクションの動作をより予測可能で効率的なものにします。

source: In the loading process, first you get HTML and with it content.
ja: コンテンツを利用できる！

source: Then you get CSS, but the content remains.
ja: これでも利用できる！

source: Finally JavaScript is put on top, but content is still there.
ja: これでもまだ利用できる！

source: Enhancement is a great thing, but only where it’s really needed.
ja: エンハンスメント（機能強化）は確かにすばらしいですが、それはその機能が本当に必要な場合の話です。

source: In a progressively enhanced setup, scripts should be inserted at the end of the document, just before the closing </body> tag.
ja: プログレッシブエンハンスメントのセットアップでは、スクリプトはドキュメントの最後、終了タグ</body>の直前に入れます。

source: This allows the main DOM content to be rendered before the scripts are executed.
ja: そうすれば、スクリプトが実行される前に、メインのDOMコンテンツを表示できます。

source: <script>// TODO: enhancement </script> </body>
ja: <script>// TODO：エンハンスメント</script> </body>

source: Managing Assets
ja: アセットの管理

source: In terms of our document setup, it’s critical we make sure the resources we are using to enhance the page content do not stand in the way of that content.
ja: ドキュメントのセットアップという観点では、ページのコンテンツを強化するためのリソースが逆にコンテンツの妨げにならないようにすることが大切です。

source: On slow networks, the content should arrive as soon as possible.
ja: たとえばネットワークの速度が遅い場合は、コンテンツができるだけ早く表示されるようにしなければなりません。

source: It’s what the user went to the page for, after all.
ja: コンテンツこそ、ユーザーがページにアクセスする目的なのですから。

source: Web fonts are typically large assets which should be treated as an enhancement.
ja: Webフォントは一般的に大きいアセットなので、エンハンスメントとして処理すべきです。

source: In particular, FOIT (flash of invisible text) should be avoided: if the font resource is indefinitely stalled (it happens!), users of some devices and browsers will be stuck with a page that has no visible text.
ja: 特にFOIT（Flash of Invisible Text）は避けた方が賢明です。フォントリソースがいつまでも読み込まれないと（実際よくあることですが）、デバイスやブラウザによってはページのテキストが表示されません。

source: That’s pretty uninclusive of users on temperamental networks.
ja: それでは、不安定なネットワークのユーザーにとってはとてもインクルーシブとは言えません。

source: The trick is to load the page then the font, using the onload event as a watershed.
ja: ポイントは、先にページを読み込んでから、onloadイベントを分岐点にしてフォントを読み込むようにすることです。
